# Open Source Data Analysis- Human Resources Data

### 1) Importing Libraries and Setting Path

In [1]:
#import libraries
import pandas as pd
import numpy as np
import os

#creating Paths
path= r'C:\Users\wjzak\Dropbox\Career Foundry\Data Immersion\Module 6- Advanced Analytics & Dashboard Design\09-2025- HR Data MNC- Analysis'

#using the path to pull file name and read the clean products data
df = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'HR_Data_MNC_Data Science Lovers.csv'), index_col = False)

### 2) Data Review and Cleaning

In [2]:
#View the first 5 entries in the data.
df.head()

,Unnamed: 0,Employee_ID,Full_Name,Department,Job_Title,Hire_Date,Location,Performance_Rating,Experience_Years,Status,Work_Mode,Salary_INR
0,0,EMP0000001,Joshua Nguyen,IT,Software Engineer,2011-08-10,"Isaacland, Denmark",5,14,Resigned,On-site,1585363
1,1,EMP0000002,Julie Williams,Marketing,SEO Specialist,2018-03-02,"Anthonyside, Costa Rica",2,7,Active,On-site,847686
2,2,EMP0000003,Alyssa Martinez,HR,HR Manager,2023-03-20,"Port Christinaport, Saudi Arabia",1,2,Active,On-site,1430084
3,3,EMP0000004,Nicholas Valdez,IT,Software Engineer,2023-10-12,"Port Shelbychester, Antigua and Barbuda",1,1,Active,On-site,990689
4,4,EMP0000005,Joel Hendricks,Operations,Logistics Coordinator,2024-12-09,"Lake Kimberly, Palestinian Territory",5,0,Active,On-site,535082

In [3]:
#drop the unnamed variable- we already have an employee ID to reference
df = df.drop(columns=['Unnamed: 0'])

In [4]:
#info about the dataset including data types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000000 entries, 0 to 1999999
Data columns (total 11 columns):
 #   Column              Dtype
---  ------              -----
 0   Employee_ID         object
 1   Full_Name           object
 2   Department          object
 3   Job_Title           object
 4   Hire_Date           object
 5   Location            object
 6   Performance_Rating  int64
 7   Experience_Years    int64
 8   Status              object
 9   Work_Mode           object
 10  Salary_INR          int64
dtypes: int64(3), object(8)
memory usage: 167.8+ MB

In [5]:
#change hire date to a time variable
df['Hire_Date'] = pd.to_datetime( df['Hire_Date'] )

#### Duplicates Check:

In [6]:
#report a summed number of duplicates
df.duplicated().sum()

np.int64(0)

#### Missing Values Check:

In [7]:
#check missingness in data
print(df.isnull().sum())

Employee_ID           0
Full_Name             0
Department            0
Job_Title             0
Hire_Date             0
Location              0
Performance_Rating    0
Experience_Years      0
Status                0
Work_Mode             0
Salary_INR            0
dtype: int64

#### Dropping and Converting Variables

In [9]:
#drop the Full_Name Variable because the data doesnt need to have this identifier for this analysis.
df = df.drop(columns=['Full_Name'])

##### Convert Indian Rupees to USD for Salary

In [10]:
#Converts the Indian Rupees to USD using the conversion of 0.01127 based on Fall 2025 conversion
df['Salary'] = np.ceil(df['Salary_INR'] * 0.01127).astype(int)
#drop old salary column from previous currency
df = df.drop(columns=['Salary_INR'])

##### Split City from Location Variable- Future Analysis is country-based

In [11]:
#Split the column into two new ones
df[['City', 'Country']] = df['Location'].str.split(',', n=1, expand=True)

In [12]:
#Remove extra space found in the split
df['City'] = df['City'].str.strip()
df['Country'] = df['Country'].str.strip()

In [13]:
#print data to check on process above
print(df)

        Employee_ID  Department                      Job_Title  Hire_Date  \
0        EMP0000001          IT              Software Engineer 2011-08-10
1        EMP0000002   Marketing                 SEO Specialist 2018-03-02
2        EMP0000003          HR                     HR Manager 2023-03-20
3        EMP0000004          IT              Software Engineer 2023-10-12
4        EMP0000005  Operations          Logistics Coordinator 2024-12-09
...             ...         ...                            ...        ...
1999995  EMP1999996  Operations          Logistics Coordinator 2010-08-31
1999996  EMP1999997          IT              Software Engineer 2021-05-07
1999997  EMP1999998       Sales   Business Development Manager 2024-05-29
1999998  EMP1999999          IT              Software Engineer 2023-02-14
1999999  EMP2000000          HR  Talent Acquisition Specialist 2020-11-11

                                        Location  Performance_Rating  \
0                             Isaacland, Denmark                   5
1                        Anthonyside, Costa Rica                   2
2               Port Christinaport, Saudi Arabia                   1
3        Port Shelbychester, Antigua and Barbuda                   1
4           Lake Kimberly, Palestinian Territory                   5
...                                          ...                 ...
1999995                         Casefurt, Serbia                   3
1999996                        Dannyport, Kuwait                   3
1999997                      Craighaven, Nigeria                   5
1999998                  Jonathanmouth, Djibouti                   4
1999999                    Morganchester, Canada                   1

         Experience_Years    Status Work_Mode  Salary                City  \
0                      14  Resigned   On-site   17868           Isaacland
1                       7    Active   On-site    9554         Anthonyside
2                       2    Active   On-site   16118  Port Christinaport
3                       1    Active   On-site   11166  Port Shelbychester
4                       0    Active   On-site    6031       Lake Kimberly
...                   ...       ...       ...     ...                 ...
1999995                14    Active    Remote    7412            Casefurt
1999996                 4    Active   On-site   11610           Dannyport
1999997                 1    Active    Remote   14799          Craighaven
1999998                 2   Retired   On-site   16677       Jonathanmouth
1999999                 4    Active    Remote   11200       Morganchester

                       Country
0                      Denmark
1                   Costa Rica
2                 Saudi Arabia
3          Antigua and Barbuda
4        Palestinian Territory
...                        ...
1999995                 Serbia
1999996                 Kuwait
1999997                Nigeria
1999998               Djibouti
1999999                 Canada

[2000000 rows x 12 columns]

Descriptives and Summaries

#### Summary Statistics:

In [25]:
#quant variables summary data
df.describe()

#cost of living in India is about 7 times lower than the US. These salary ranges may need adjustment in the anaylsis

,Hire_Date,Performance_Rating,Experience_Years,Salary
count,2000000,2.000000e+06,2.000000e+06,2.000000e+06
mean,2020-02-11 07:02:40.689599488,3.000148e+00,5.010287e+00,1.010842e+04
min,2010-08-14 00:00:00,1.000000e+00,0.000000e+00,3.381000e+03
25%,2017-06-27 00:00:00,2.000000e+00,2.000000e+00,6.947000e+03
50%,2020-08-12 00:00:00,3.000000e+00,5.000000e+00,9.141000e+03
75%,2023-02-09 00:00:00,4.000000e+00,8.000000e+00,1.210200e+04
max,2025-08-13 00:00:00,5.000000e+00,1.500000e+01,3.381000e+04
std,NaN,1.413973e+00,3.608823e+00,4.537418e+03

In [15]:
#Printing summaries of the various important variables in the dataset
print(df['Country'].value_counts())

Country
Congo                     16286
Korea                     16285
Sri Lanka                  8409
Switzerland                8391
British Virgin Islands     8373
                          ...
Indonesia                  7983
Kazakhstan                 7973
Montenegro                 7972
Bhutan                     7971
Palestinian Territory      7895
Name: count, Length: 243, dtype: int64

In [16]:
print(df['Department'].value_counts())

Department
IT            601042
Sales         400031
Operations    300095
Marketing     240081
Finance       199873
HR            159119
R&D            99759
Name: count, dtype: int64

In [17]:
print(df['Job_Title'].value_counts())

Job_Title
Software Engineer                300358
Sales Executive                  199982
Operations Executive             150058
Data Analyst                     120375
Marketing Executive              120154
Account Manager                  119929
Accountant                       100307
DevOps Engineer                   90197
Logistics Coordinator             90188
HR Executive                      79348
SEO Specialist                    71692
Business Development Manager      60233
IT Manager                        60224
Financial Analyst                 59815
Research Scientist                50017
Talent Acquisition Specialist     47994
Supply Chain Manager              44935
Content Strategist                36154
CTO                               29888
Product Developer                 29872
Finance Manager                   29799
HR Manager                        23841
Sales Director                    19887
Operations Director               14914
Lab Technician                    14829
Brand Manager                     12081
CFO                                9952
HR Director                        7936
Innovation Manager                 5041
Name: count, dtype: int64

In [18]:
print(df['Status'].value_counts())

Status
Active        1401558
Resigned       398660
Retired         99912
Terminated      99870
Name: count, dtype: int64

In [19]:
#Create a binary variable for active users vs inactive
df['Status2'] = df['Status'].replace({
    'Resigned': 'Inactive',
    'Retired': 'Inactive',
    'Terminated': 'Inactive'
})
print(df['Status2'].value_counts())

Status2
Active      1401558
Inactive     598442
Name: count, dtype: int64

In [20]:
print(df['Work_Mode'].value_counts())

Work_Mode
On-site    1199109
Remote      800891
Name: count, dtype: int64

### 3) Data Export to Prepared Folder

In [27]:
#Save updated csv file to Prepared Data Folder
df.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'HR_Data_MNC_Data_Cleaned.csv'))